package 과제.level4;

public class Level4_1 {
    public static void main(String[] args) {
        /*

            주제 : 용어 정의하기

            1. 객체란 ?
                : 물리적으로 존재하거나 추상적으로 생각할 수 있는 것 중에서
                  자신의 속성을 가지고 있으면서 식별 가능한 것을 말한다.

            2. 클래스란 ?
                : 여러 개의 객체를 생성할 수 있는 설계도이며, 필드, 생성자, 메소드로 이루어져 있다.

            3. 멤버변수/필드/속성/특성 이란?
                : 클래스 내부에 선언된 변수이다. 고유 속성을 갖고 있다.

            4. 지역변수와 멤버변수의 차이점을 서술하시오.
                : 지역변수는 선언 위치가 메소드나 생성자 내부이고, 멤버변수는 선언 위치가 클래스 영역이다.
                 지역변수는 생성자와 메소드 내에서만 사용되고 생성자와 메소드가 실행 종료되면 자동으로 소멸된다.
                 멤버변수는 생성자와 메소드 전체에서 사용되며 객체가 생성될 때 할당되고 객체가 소멸했을 때 소멸된다.

        */

    }

}
